package org.wiky.letscorp.util;

import java.util.Random;

/**
 * Created by wiky on 8/3/16.
 */
public class Username {

    private static Random mRandom = new Random();
    private static String[] mNames = new String[]{
            "王尼玛", "皮卡丘", "豌豆射手", "赵日天", "徐俊", "五毛", "小红粉", "亚古兽", "脑残粉",
            "王也夫", "叶良辰", "程序员", "喷火龙", "アメリカ人", "六毛", "七毛", "八毛", "十二毛",
            "奥巴马", "包子", "じんぴん", "三胖", "鸣人", "奥特曼", "李刚", "路人", "土豆地雷", "妙娃种子",
            "达斯维达", "笛卡尔", "叔本华", "爱因斯坦", "王益", "柯南", "以太网", "火星", "冥王星",
            "NASA", "上海人", "赵子龙", "你**", "《Unix环境高级编程》", "《TCP/IP详解》", "果粉", "Google",
            "わたし", "土鳖", "警察", "律师", "医生", "作家", "乞丐", "小黄人", "操作系统", "大气层",
            "男人", "女人", "狗奴才", "神奇宝贝训练家", "神奇宝贝大师", "美分", "日元", "英镑", "港币",
            "天气", "蜻蜓", "兔子", "猎豹", "树", "北极熊", "APP开发者", "张信哲", "さどし", "照片",
            "螃蟹", "用户"
    };
    private static String[] mAdjs = new String[]{
            "勇敢", "坚强", "调皮", "牛逼", "傻逼", "脑残", "萌萌", "高兴", "悲伤",
            "傲慢", "倔强", "漫不经心的", "脆弱", "脆弱", "急躁", "缺乏安全感", "乐观",
            "爽朗", "豪放", "勇敢", "温柔体贴", "放荡", "綺麗", "无敌", "呵呵", "高大", "英俊",
            "美丽", "优雅", "活泼", "时尚", "聪明", "能干", "健康", "勤劳", "阳光", "好学", "俏丽", "忠心",
            "善良", "坚强", "独立", "团结", "优美", "义气", "智慧", "大度", "豁达", "开朗", "富有",
            "专心", "勤劳", "乐观", "可爱", "热心", "孝顺", "妩媚", "丽人", "矜持", "佳丽", "柔美", "婉丽", "娉婷",
            "婉顺", "娇柔", "可爱", "温柔", "体贴", "贤惠", "贤慧", "才干", "人才", "沉鱼落雁", "闭月羞花", "袅娜",
            "赞美", "赞赏", "回眸一笑百媚生", "端庄优雅", "大家闺秀", "优雅大方", "婀娜多姿", "秀外慧中", "慧质兰心",
            "清新单纯", "面若桃花", "天生丽质", "如琬似花", "宛如天仙", "仙女下凡", "气质非凡", "秀而不媚",
            "长相骏雅", "身付异秉", "才思敏捷", "过目不忘", "十年寒窗", "博学多才", "见多识广",
            "才高八斗", "学富五车", "文武双全", "雄韬伟略", "谈吐不凡", "谈笑风声", "高谈阔论", "运筹帷幄",
            "言简意赅", "完美无缺", "一针见血", "远见卓识", "义正词严", "一气呵成", "大显神通", "出口成章",
            "出类拔萃", "出神入化", "万古流芳", "一本正经", "一箭双雕", "长篇大论", "功德无量", "力排众议",
            "力挽狂澜", "气贯长虹", "气势磅礴", "气吞山河", "坚韧不拔", "身体力行", "空前绝后", "视死如归",
            "英姿焕发", "奉公守法", "艰苦奋斗", "忠贞不渝", "舍己为人", "大公无私", "一尘不染", "一鸣惊人",
            "叱诧风云", "排山倒海", "惊涛骇浪", "雷霆万钧", "惊心动魄", "横扫千军", "惊天动地", "文从字顺",
            "十全十美", "无懈可击", "无与伦比", "励精图治", "壮志凌云", "高瞻远瞩", "忍辱负重", "盖世无双",
            "龙飞凤舞", "一丝不苟", "身兼数职", "日理万机", "明察秋毫", "英明果断", "分身有术", "孜孜不倦",
            "习近平", "矮小", "猥琐", "萎靡", "奸诈", "歹毒", "毒辣", "丑陋", "弱智", "愚笨", "愚蠢", "阴暗",
            "贬斥", "否定", "憎恨", "轻蔑", "责骂", "叛逆", "汉奸", "低能", "恶心", "阴险", "白痴", "变态", "三八",
            "腐败", "呆板", "呆滞", "土气", "无能", "懒惰", "慵懒", "庸才", "废物", "风骚", "下贱", "病夫", "脆弱",
            "俗气", "小气", "贫穷", "贫贱", "花心", "悲观", "市井", "小人", "幼稚", "手下败将", "自以为是", "处心积虑",
            "口是心非", "阴险狡诈", "鼠目寸光", "贼眉鼠眼", "恶贯满盈", "勾心斗角", "爱慕虚荣", "财迷心窍", "好吃懒做",
            "离经叛道", "掩耳盗铃", "口是心非", "朝三暮四", "狐假虎威", "子虚乌有", "指鹿为马", "纵虎归山", "按图索骥",
            "独善其身", "规行矩步", "另起炉灶", "绵里藏针", "穷形极相", "舞文弄墨"
    };

    public static String random() {
        mRandom.setSeed(System.currentTimeMillis());
        String name = mNames[mRandom.nextInt(mNames.length)];
        String adj = mAdjs[mRandom.nextInt(mAdjs.length)];
        return adj + "的" + name;
    }
}
